uhnp/src/DataProcessors/ПомощникПланирования/ПомощникПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникПланирования</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>Обеспечение</name>
    <type>
      <types>EnumRef.ВариантыВключенияПозицийПотребностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборНоменклатурыПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеТребования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Субъекты223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <comment>0 - корзина; 1 - Потребности к обработке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОбработки</name>
    <comment>0 - Новый черновик; 1 - Согласно параметрам закупки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварныеКатегории</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварнаяКатегория</name>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварнаяКатегорияНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварнаяКатегория</name>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>ОКПД2</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Действия</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Колво</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обработать</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Настроить</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапущеноФоновоеЗадание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПериодыПотребности</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ПараметрыЗакупкиПотребностей1/ПараметрыЗакупкиПотребностей1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЗакупкиПотребностей1</name>
  <resources>
    <name>КлючПараметровЗакупки</name>
    <type>
      <types>CatalogRef.КлючиПараметровЗакупки</types>
    </type>
  </resources>
  <resources>
    <name>ПериодПотребности</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <attributes>
    <name>ПоложениеОЗакупках</name>
    <type>
      <types>CatalogRef.ПоложениеОЗакупках</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДУсловия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПериодПотребности</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодПотребностиЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПроектыСПЗ/ПроектыСПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроектыСПЗ</name>
  <resources>
    <name>Обеспечение</name>
    <type>
      <types>EnumRef.ВариантыВключенияПозицийПотребностей</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьВ</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ИдентификаторыСтрокПлановЗакупок</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбщиеТребования</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЦФОИсполнитель</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </resources>
  <resources>
    <name>МестоПоставки</name>
    <type>
      <types>CatalogRef.МестаПоставки</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ПериодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоложениеОплаты</name>
    <type>
      <types>CatalogRef.ПоложениеОЗакупках</types>
    </type>
  </resources>
  <resources>
    <name>УИДУсловияОплаты</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЦентрализованныеЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПроектыСПЗПозиции/ПроектыСПЗПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроектыСПЗПозиции</name>
  <resources>
    <name>Количество</name>
    <comment>Количество потребности в базовой единице измерения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>В валюте учета закупок</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПотребности</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаИсточника</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланирования</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдПроекта</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПроектыСПЗПараметры/ПроектыСПЗПараметры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроектыСПЗПараметры</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ПараметрыЗакупки</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПоложениеОЗакупках</name>
    <type>
      <types>CatalogRef.ПоложениеОЗакупках</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДУсловия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыЗакупки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ПланированиеПотребностей/ПланированиеПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланированиеПотребностей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИсточникВерсии</name>
    <type>
      <types>DefinedType.ИсточникВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаДокумента</name>
    <type>
      <types>DefinedType.КорректировкаДокумента</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаИсточника</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланирования</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/ДействиеПоложенийОЗакупках/ДействиеПоложенийОЗакупках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДействиеПоложенийОЗакупках</name>
  <resources>
    <name>Положение</name>
    <type>
      <types>CatalogRef.ПоложениеОЗакупках</types>
    </type>
  </resources>
  <resources>
    <name>Контролировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупок</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ЭтапыПланированияПотребностей/ЭтапыПланированияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПланированияПотребностей</name>
  <enumValues>
    <name>ЗаявкиНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиСогласованные</name>
  </enumValues>
  <enumValues>
    <name>БюджетЗакупокОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>ВыбранПоставщик</name>
  </enumValues>
  <enumValues>
    <name>Законтрактовано</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>Исполнено</name>
    <comment>Движений по этому разделу нет и не будет</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиАналитикиПланированияСтруктуры/КлючиАналитикиПланированияСтруктуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияСтруктуры</name>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/DataProcessors/ПомощникПланирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущееСостояниеКлассификацииОКПД2НаСервере(Параметры) Экспорт 
	
	Если Параметры.Свойство("ОтборыПоРеквизитам") Тогда
		ОтборыПоРеквизитам = Параметры.ОтборыПоРеквизитам;
	Иначе
		ОтборыПоРеквизитам = Неопределено;
	КонецЕсли;
	
	КолвоПозиций = Отчеты.ПозицииПотребностейБезКодаОКПД2.ПолучитьКолвоПозицийБезОКПД2(Параметры.Пользователь, Параметры.ПериодЗакупок, ОтборыПоРеквизитам);
	
	ЧастиСтроки = Новый Массив;
	
	Если КолвоПозиций > 0 Тогда
		СтрКолвоПозиций = СтрШаблон(НСтр("ru = '%1 поз.'"), КолвоПозиций);
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрКолвоПозиций, Новый Шрифт("Consolas"), ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПотребностиБезОКПД2"));
	Иначе
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'нет'"), Новый Шрифт("Consolas"), ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПотребностиБезОКПД2"));
	КонецЕсли;
	
	Возврат Новый Структура("Значение, Описание, Действие", 
								КолвоПозиций, 
								Новый ФорматированнаяСтрока(ЧастиСтроки), 
								"ОКПД2");
	
КонецФункции   

Функция ПолучитьТекущееСостояниеАналоговНаСервере(Параметры) Экспорт 
	
	Если ЗначениеЗаполнено(Параметры.ПериодПотребностей) Тогда    
		
		Отборы = Параметры.ОтборыПоРеквизитам;
		Отборы.Вставить("АналогНоменклатура", Новый Структура("ВидСравнения, Значение", "Заполнено", 	""));
		Отборы.Вставить("ЕстьАналоги", 		  Новый Структура("ВидСравнения, Значение", "Равно", 		Истина));    
		
		КолвоПозицийЗаменыНаАналоги = Отчеты.ОтчетОПримененииАналогов.ПолучитьКолвоПозицийДляЗаменыНаАналоги(Параметры.Пользователь, Параметры.ПериодЗакупок, Отборы); 
		КолвоПозицийБезЗаменыНаАналоги = Отчеты.ОтчетОПримененииАналогов.ПолучитьКолвоПозицийДляЗаменыНаАналоги(Параметры.Пользователь, Параметры.ПериодЗакупок, Отборы);	
		
		// Наличие унификатов
		ЧастиСтроки = Новый Массив;
		Если КолвоПозицийЗаменыНаАналоги > 0 Тогда
			СтрКолвоПозиций = СтрШаблон(НСтр("ru = '%1 поз.'"), КолвоПозицийЗаменыНаАналоги);
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрКолвоПозиций, Новый Шрифт("Consolas"), ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПотребностиКЗаменеНаАналоги"));
			ЧастиСтроки.Добавить("   ");
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Нстр("ru = '<Обработать>'"), Новый Шрифт("Consolas",,Истина,,Истина), ЦветаСтиля.ГиперссылкаЦвет, , "Обработать_ВыполнитьОбработкуАналогов"));
			ЧастиСтроки.Добавить("   ");
		Иначе
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'нет'"), Новый Шрифт("Consolas"), ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПотребностиКЗаменеНаАналоги"));
			ЧастиСтроки.Добавить("   ");
		КонецЕсли;
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Нстр("ru = '<Настроить>'"), Новый Шрифт("Consolas",,Истина,,Истина), ЦветаСтиля.ГиперссылкаЦвет, , "Обработка_УправлениеАналогами"));
		ЧастиСтроки.Добавить(".");                 
		
	Иначе   
		
		ЧастиСтроки = Новый Массив;	
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'нет'"), Новый Шрифт("Consolas"), ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПотребностиКЗаменеНаАналоги"));
		КолвоПозицийЗаменыНаАналоги = 0;
		
	КонецЕсли;   
	
	ТекстНастройка = СтрШаблон(НСтр("ru = ' (доступно к замене %1 позиций)'"), КолвоПозицийБезЗаменыНаАналоги);
	
	Возврат Новый Структура("Значение, Описание, Действие, ОписаниеНастройка", 
								КолвоПозицийЗаменыНаАналоги, 
								Новый ФорматированнаяСтрока(ЧастиСтроки), 
								"Аналоги", 
								ТекстНастройка);
	
КонецФункции

Функция ПолучитьТекущееСостояниеПравилНаСервере(Параметры) Экспорт
	// Инициализация.
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("КолвоПозиций", 0);
	РезультатФункции.Вставить("Описание", "");
	// Получение исходных данных.
	ВыгрузкаОрганизации = ПолучитьМассивОрганизацияПотребностиБезПравил(Параметры.ПериодЗакупок.ПериодЗакупок, Параметры);
	// Формирование строки представления.
	КолвоПозиций = ВыгрузкаОрганизации.Количество();
	ЧастиСтроки = Новый Массив;
	Если КолвоПозиций > 0 Тогда
		СтрКолвоПозиций = СтрШаблон(НСтр("ru = '%1 поз.'"), КолвоПозиций);
		ШрифтОбычный = Новый Шрифт("Consolas");
		ШрифтВыделенный = Новый Шрифт("Consolas", , Истина, , Истина);
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрКолвоПозиций, ШрифтОбычный, ЦветаСтиля.ГиперссылкаЦвет,, "Отчет_ПравилаПотребностей"));
		ЧастиСтроки.Добавить("   ");
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '<Обработать>'"), ШрифтВыделенный, ЦветаСтиля.ГиперссылкаЦвет, , "Обработать_ПравилаПотребностей"));
	Иначе
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'нет'"), ШрифтОбычный, ЦветаСтиля.ГиперссылкаЦвет, , "Отчет_ПравилаПотребностей"));
	КонецЕсли;
	Описание = Новый ФорматированнаяСтрока(ЧастиСтроки);
	// Заполение итоговой структуры.
	
	Возврат Новый Структура("Значение, Описание, Действие, ОписаниеНастройка", 
								КолвоПозиций, 
								Описание, 
								"ПравилаПотребностей");
КонецФункции     
							
Функция РасчитатьПараметрыПотребностейПоПользователю(Параметры) Экспорт

	РезультатРасчета = РегистрыСведений.ПараметрыЗакупкиПотребностей1.РассчитатьПараметрыЗакупкиПоПользователю(Параметры.Пользователь, Параметры);
	Возврат Новый Структура("Значение, Описание, Действие, ОписаниеНастройка", 
								РезультатРасчета.Количество, 
								"", 
								"ПараметрыПотребностейПоПользователю");

КонецФункции // РасчитатьПараметрыПотребностейПоПользователю()

Функция СформироватьПроектыЗакупокНаСервере(Параметры) Экспорт
	
	ДеревоПроектов 		= Параметры.ДеревоПроектов.Получить();   
	ТекущийПользователь = Параметры.ТекущийПользователь;  
	ПериодПотребностей 	= Параметры.ПериодПотребностей;
	ПустойУИД 			= Параметры.ПустойУИД;
	
	// Расчет параметров СПЗ
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить(Тип("Число"));
	ПростыеТипы.Добавить(Тип("Строка"));
	ПростыеТипы.Добавить(Тип("Дата"));
	ПростыеТипы.Добавить(Тип("Булево"));      
	
	СписокДокументов = Новый СписокЗначений; 
	
	ЭтоУХ = ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы");
	
	Для Каждого Проект Из ДеревоПроектов.Строки Цикл   
		
		НачатьТранзакцию();
		ЗаписьПроект = РегистрыСведений.ПроектыСПЗ.СоздатьМенеджерЗаписи(); 
		ЗаписьПроект.Активность = Истина;
		//Измерения
		ЗаписьПроект.Автор = Параметры.ТекущийПользователь; 
		ЗаписьПроект.ПериодЗакупки = Параметры.ПериодПотребностей; 
		ЗаписьПроект.ИД = Новый УникальныйИдентификатор;
		ЗаписьПроект.Дата = ТекущаяДата(); 
		
		ЗаписьПроект.МестоПоставки = Проект.МестоПоставки;
		ЗаписьПроект.Обеспечение = Проект.Обеспечение; 
		ЗаписьПроект.ОрганизацияЗаказчик = Проект.Контрактант; 
		ЗаписьПроект.Дата = Проект.ПериодЗакупки;       
		ЗаписьПроект.ОбщиеТребования = Проект.ПредставлениеПотребности;   
		ЗаписьПроект.Сумма = Проект.Сумма;
		ЗаписьПроект.ПериодПредставление = Проект.ПредставлениеДатаОперации;
		  
		
		//Позиции
		Для Каждого Потребность Из Проект.Строки Цикл   
			
			нз = РегистрыСведений.ПроектыСПЗПозиции.СоздатьНаборЗаписей();
			нз.Отбор.Автор.Установить(Параметры.ТекущийПользователь);
			нз.Отбор.ПериодЗакупки.Установить(Параметры.ПериодПотребностей);
			нз.Отбор.ИД.Установить(Параметры.ПустойУИД);    
			нз.Отбор.АналитикаИсточника.Установить(Потребность.АналитикаИсточника); 
			нз.Отбор.АналитикаПланирования.Установить(Потребность.АналитикаПланирования);
			нз.Очистить();
			нз.Записать(Истина);
		
			Менеджер = РегистрыСведений.ПроектыСПЗПозиции.СоздатьМенеджерЗаписи();     
			ЗаполнитьЗначенияСвойств(Менеджер, Потребность);
			Менеджер.ИД 			= ЗаписьПроект.ИД;     
			Менеджер.Автор 			= ЗаписьПроект.Автор;  
			Менеджер.ПериодЗакупки 	= ЗаписьПроект.ПериодЗакупки;  
			Менеджер.ПериодПотребности = Потребность.ПериодПотребности;  
			//todo msle 2023-06-02 Одним запросом 
			Менеджер.АналитикаНоменклатуры 	= Менеджер.АналитикаПланирования.АналитикаНоменклатуры;
			Менеджер.АналитикаПотребностей 	= Менеджер.АналитикаПланирования.АналитикаПотребностей; 
			Менеджер.АналитикаСтруктуры 	= Менеджер.АналитикаПланирования.АналитикаСтруктуры;
			
			Менеджер.Записать(Истина);  
			
		КонецЦикла; //Позиции 
		
		// Параметры ПроектаСПЗ
		нзПараметры = РегистрыСведений.ПроектыСПЗПараметры.СоздатьНаборЗаписей();
		нзПараметры.Отбор.Автор.Установить(ЗаписьПроект.Автор);
		нзПараметры.Отбор.ПериодЗакупки.Установить(ЗаписьПроект.ПериодЗакупки);
		нзПараметры.Отбор.ИД.Установить(ЗаписьПроект.ИД);
		нзПараметры.Очистить();
		
		Ключ = Новый Структура("Автор, ПериодЗакупки, ИД, АналитикаНоменклатуры, АналитикаСтруктуры, АналитикаПотребностей",
								ЗаписьПроект.Автор, ЗаписьПроект.ПериодЗакупки, ЗаписьПроект.ИД,
								Справочники.КлючиАналитикиПланированияНоменклатуры.ПустаяСсылка(),
								Справочники.КлючиАналитикиПланированияСтруктуры.ПустаяСсылка(),
								Справочники.КлючиАналитикиПланированияПотребностей.ПустаяСсылка());
		
		Итоговые = "Свойство, Значение, ЗапретИзменения";
		Детали = "Свойство, Значение, ЗапретИзменения, АналитикаНоменклатуры, АналитикаСтруктуры, АналитикаПотребностей, ПоложениеОЗакупках, УИДУсловия";  
		//
		СвойстваПроекта = Новый Соответствие;               
		СвойстваПроекта.Вставить(ПланыВидовХарактеристик.ПараметрыЗакупки.Организатор, 		Проект.Организатор);
		СвойстваПроекта.Вставить(ПланыВидовХарактеристик.ПараметрыЗакупки.СпособЗакупки, 	Проект.СпособЗакупки);    
		
		СвойстваПроекта.Вставить(ПланыВидовХарактеристик.ПараметрыЗакупки.Электронно, 		Проект.СпособЗакупки.ЭлектроннаяФорма); 
		СвойстваПроекта.Вставить(ПланыВидовХарактеристик.ПараметрыЗакупки.СМП, 				Проект.СпособЗакупки.МСП);
		СвойстваПроекта.Вставить(ПланыВидовХарактеристик.ПараметрыЗакупки.ПриоритетСМП, 	Проект.СпособЗакупки.МСПСубПодряд);
		
		////////////////////////////////////////////////////////////////////////////////////
		
		ДанныеАвтоФормирования = Новый Структура("Параметры", Новый Структура);
		ДанныеАвтоФормирования.Параметры.Вставить("ПериодЗакупки", 	Параметры.ПериодПотребностей);
		ДанныеАвтоФормирования.Параметры.Вставить("ПустойУИД", 		Параметры.ПустойУИД);
		ДанныеАвтоФормирования.Параметры.Вставить("Автор", 			Параметры.ТекущийПользователь);
		
		ВсеПотребности = ВсеПотребностиВКорзине(Проект, ДеревоПроектов); 
		ВсеПотребности.Колонки.Количество.Имя = "КоличествоКОбработке"; 
		ВсеПотребности.Колонки.Сумма.Имя = "СуммаКОбработке";
		//
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ОбщегоНазначенияУХ.ЗагрузитьТаблицуВоВременнуюТаблицуЗапроса(Запрос, "ВТ_Потребности", ВсеПотребности);
		
		Для Каждого КлючЗначение Из ДанныеАвтоФормирования.Параметры Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;   
		
		Запрос.Текст = ТекстЗапроса_ПолучитьДанныеДляАвтоматическогоФормированияСПЗ();
		Запрос.УстановитьПараметр("ПериодЗакупки",ПериодПотребностей);
		Результат = Запрос.Выполнить();
		
		ПотребностиСПараметрамиЗакупки = Результат.Выгрузить();  
		
		ТаблицаПараметровЗакупки = ПланыВидовХарактеристик.ПараметрыЗакупки.ПолучитьТаблицуНастроекПараметровЗакупки();
		
		ПараметрыЗакупки = СформироватьДеревоПараметровЗакупки(ПотребностиСПараметрамиЗакупки, ТаблицаПараметровЗакупки); 
		
		ПараметрыОплатыПроектов = Новый Соответствие;
		
		Для Каждого ПараметрЗакупки Из ПараметрыЗакупки.Строки Цикл   
			
			Если Не ЭтоУХ Тогда	
				//ПараметрыОплаты
				ПараметрыОплаты = ПараметрыОплатыПроектов.Получить(ЗаписьПроект.ИД);
				Если ПараметрыОплаты = Неопределено Тогда       
					ПараметрыОплаты = Справочники.ПоложениеОЗакупках.ПолучитьПараметрыОплаты(ПараметрЗакупки.ПоложениеОЗакупках, ПараметрЗакупки.УИДУсловия);  
					ПараметрыОплатыПроектов.Вставить(ЗаписьПроект.ИД, ПараметрыОплаты);
					ЗаписьПроект.ПоложениеОплаты 	= ПараметрЗакупки.ПоложениеОЗакупках;
					ЗаписьПроект.УИДУсловияОплаты 	= ПараметрЗакупки.УИДУсловия;	
				КонецЕсли;            
				
				//ГрафикОплаты
				Если ПараметрЗакупки.Свойство = ПланыВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты Тогда
					ПараметрЗакупки.Значение = ПараметрыОплаты.ГрафикОплаты;  
					ПараметрЗакупки.ЗапретИзменения = ПараметрыОплаты.ЗапретИзменения_ГрафикОплаты;    
				КонецЕсли;   
				//КалендарьГрафика
				Если ПараметрЗакупки.Свойство = ПланыВидовХарактеристик.ПараметрыЗакупки.КалендарьГрафика Тогда
					ПараметрЗакупки.Значение = ПараметрыОплаты.КалендарьГрафика;  
					ПараметрЗакупки.ЗапретИзменения = ПараметрыОплаты.ЗапретИзменения_КалендарьГрафика;    
				КонецЕсли;         
			КонецЕсли;
			
			
			дв = нзПараметры.Добавить();
			ЗаполнитьЗначенияСвойств(дв, Ключ); 
			дв.Свойство = ПараметрЗакупки.Свойство;
			
			ЗначениеПроекта = СвойстваПроекта.Получить(ПараметрЗакупки.Свойство);
			Если ЗначениеПроекта = Неопределено Тогда           
				дв.Значение = ПараметрЗакупки.Значение;     
			Иначе
				дв.Значение = ЗначениеПроекта;
			КонецЕсли;        
			
		КонецЦикла;
		
		ЗаписьПроект.Записать(Истина); 
		нзПараметры.Записать(Истина); 
		
		РегистрыСведений.ПроектыСПЗ.ОбработатьПроектСПЗ(Параметры.ТекущийПользователь, ЗаписьПроект.ОрганизацияЗаказчик, ЗаписьПроект.ПериодЗакупки, ЗаписьПроект.ИД, СписокДокументов);
		
		ЗафиксироватьТранзакцию();
		                                              
	КонецЦикла;   
	
	Возврат СписокДокументов;
	
КонецФункции
#КонецОбласти

							
#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьМассивОрганизацияПотребностиБезПравил(ПериодЗакупокВход, Параметры) Экспорт   
	
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.АналитикаПланирования.АналитикаСтруктуры.Организация КАК Организация,
		|	ЕСТЬNULL(ДействиеПоложенийОЗакупках.Положение, ЗНАЧЕНИЕ(Справочник.ПоложениеОЗакупках.ПустаяСсылка)) КАК Положение,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Характеристика КАК Характеристика,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДанныеРегистра.КоличествоОстаток КАК КоличествоОстаток,
		|	ДанныеРегистра.СуммаОстаток КАК СуммаОстаток,
		|	ДанныеРегистра.АналитикаПланирования КАК АналитикаПланирования
		|ПОМЕСТИТЬ ВТ_ДанныеПотребностей
		|ИЗ
		|	РегистрНакопления.ПланированиеПотребностей.Остатки(
		|			,
		|			(АналитикаПланирования.Этап = ЗНАЧЕНИЕ(Перечисление.ЭтапыПланированияПотребностей.ЗаявкиНаЗакупку)
		|				ИЛИ АналитикаПланирования.Этап = ЗНАЧЕНИЕ(Перечисление.ЭтапыПланированияПотребностей.ЗаявкиСогласованные))
		|				И (АналитикаПланирования.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода)) КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеПоложенийОЗакупках КАК ДействиеПоложенийОЗакупках
		|		ПО ДанныеРегистра.АналитикаПланирования.АналитикаСтруктуры.Организация = ДействиеПоложенийОЗакупках.Организация
		|			И (ДействиеПоложенийОЗакупках.ПериодЗакупок = &ПериодЗакупок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ДействиеПоложенийОЗакупках.Положение, ЗНАЧЕНИЕ(Справочник.ПоложениеОЗакупках.ПустаяСсылка)),
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.Характеристика,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения,
		|	ДанныеРегистра.КоличествоОстаток,
		|	ДанныеРегистра.СуммаОстаток,
		|	ДанныеРегистра.АналитикаПланирования.АналитикаСтруктуры.Организация,
		|	ДанныеРегистра.АналитикаПланирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеПотребностей.Организация КАК Организация,
		|	ВТ_ДанныеПотребностей.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеПотребностей.Характеристика КАК Характеристика,
		|	ВТ_ДанныеПотребностей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеПотребностей.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ВТ_ДанныеПотребностей КАК ВТ_ДанныеПотребностей
		|ГДЕ
		|	ВТ_ДанныеПотребностей.Положение = ЗНАЧЕНИЕ(Справочник.ПоложениеОЗакупках.ПустаяСсылка)
		|	И (&ВсеОрганизации
		|			ИЛИ ВТ_ДанныеПотребностей.Организация В (&Организация))";   
	      
	
	Организации = Неопределено;
	Если Параметры <> Неопределено Тогда
		Если Параметры.Свойство("ОтборыПоРеквизитам") И Параметры.ОтборыПоРеквизитам.Свойство("Организация") Тогда
			Организации = Параметры.ОтборыПоРеквизитам.Организация.Значение;
		КонецЕсли;
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.ПериодЗакупок.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.ПериодЗакупок.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодЗакупок", ПериодЗакупокВход);
	Запрос.УстановитьПараметр("ВсеОрганизации", Организации = Неопределено);
	Запрос.УстановитьПараметр("Организация", 	?(Организации <> Неопределено, Организации, Новый СписокЗначений));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Организация");
	РезультатФункции = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатФункции);
	РезультатФункции = ОбщегоНазначенияКлиентСерверУХ.УдалитьПустыеЭлементыМассива(РезультатФункции);
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьМассивОрганизацияПотребностиБезПравил()

Функция ВсеПотребностиВКорзине(ПроектОтбор, КорзинаДерево)
	
	Перем КолонкаДерева, КорзинаТаблица, Потребность, Проект;
	
	КорзинаТаблица = Новый ТаблицаЗначений;
	Для Каждого КолонкаДерева Из КорзинаДерево.Колонки Цикл 
		КорзинаТаблица.Колонки.Добавить(КолонкаДерева.Имя, КолонкаДерева.ТипЗначения, КолонкаДерева.Заголовок);
	КонецЦикла;    
	Если ПроектОтбор = Неопределено Тогда
		Для Каждого Проект Из КорзинаДерево.Строки Цикл     
			Для Каждого Потребность Из Проект.Строки Цикл    
				ЗаполнитьЗначенияСвойств(КорзинаТаблица.Добавить(), Потребность);
			КонецЦикла;                                                   
		КонецЦикла;
	Иначе
		Для Каждого Потребность Из ПроектОтбор.Строки Цикл    
			ЗаполнитьЗначенияСвойств(КорзинаТаблица.Добавить(), Потребность);
		КонецЦикла;
	КонецЕсли;
	Возврат КорзинаТаблица;

КонецФункции

Функция СформироватьДеревоПараметровЗакупки(ДанныеСПЗ, Знач ТаблицаПараметровЗакупки = неопределено)
	
	Если ТаблицаПараметровЗакупки = неопределено Тогда
		ТаблицаПараметровЗакупки = ПланыВидовХарактеристик.ПараметрыЗакупки.ПолучитьТаблицуНастроекПараметровЗакупки();
	КонецЕсли;       
	
	ТаблицаПараметровЗакупкиКопия = ТаблицаПараметровЗакупки.Скопировать();   
	
	ЭтоУХ = ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы");
	
	//
	Дерево = Новый ДеревоЗначений;
	Таблица = РегистрыСведений.ПроектыСПЗПараметры.СоздатьНаборЗаписей().Выгрузить();
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;    
	
	Дерево.Колонки.Добавить("ДетальнаяЗапись", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ИндексКартинки", ОбщегоНазначения.ОписаниеТипаЧисло(3,0));   
	
	// Формируем список необходимых реквизитов таблицы ДанныеСПЗ
	мРеквизитыПотребностей = Новый Массив;
	мРеквизитыПотребностей.Добавить("АналитикаНоменклатуры");
	мРеквизитыПотребностей.Добавить("АналитикаПотребностей");
	мРеквизитыПотребностей.Добавить("АналитикаСтруктуры");
	мРеквизитыПотребностей.Добавить("ПоложениеОЗакупках");
	мРеквизитыПотребностей.Добавить("УИДУсловия");    
	
	Для Каждого ПараметрЗакупки Из ТаблицаПараметровЗакупкиКопия Цикл   
		Если ДанныеСПЗ.Колонки.Найти(ПараметрЗакупки.ПараметрИмя) <> Неопределено Тогда
			мРеквизитыПотребностей.Добавить(ПараметрЗакупки.ПараметрИмя);     
		КонецЕсли;                           
		Если ДанныеСПЗ.Колонки.Найти(ПараметрЗакупки.ЗапретИзменения) <> Неопределено Тогда
			мРеквизитыПотребностей.Добавить(ПараметрЗакупки.ЗапретИзменения);  
		КонецЕсли;
	КонецЦикла;
	РеквизитыПотребностей = СтрСоединить(мРеквизитыПотребностей, ",");
	
	//
	Потребности = ДанныеСПЗ.Скопировать(,РеквизитыПотребностей);
	Потребности.Свернуть(РеквизитыПотребностей);    
	
	РеквизитыОплаты = ?(ЭтоУХ, 
						"", 
						", КалендарьГрафика, ЗапретИзменения_КалендарьГрафика, ГрафикОплаты, ЗапретИзменения_ГрафикОплаты");  
	Колонки = СтрРазделить("ПоложениеОЗакупках, УИДУсловия, " + РеквизитыОплаты, ",");      
	КолонкиРезультат = Новый Массив;
	Для Каждого ИмяКолонки Из Колонки Цикл    
		Если ДанныеСПЗ.Колонки.Найти(СокрЛП(ИмяКолонки)) <> Неопределено Тогда
			КолонкиРезультат.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОплатыПроектов = ДанныеСПЗ.Скопировать(, СтрСоединить(КолонкиРезультат, ", ")); 
	ПараметрыОплатыПроектов.Свернуть(СтрСоединить(КолонкиРезультат, ", "));  
	
	Если Не ЭтоУХ Тогда
		Для Каждого ПараметрыОплатыПроекта Из ПараметрыОплатыПроектов Цикл   
			ПараметрыОплаты = Справочники.ПоложениеОЗакупках.ПолучитьПараметрыОплаты(ПараметрыОплатыПроекта.ПоложениеОЗакупках, ПараметрыОплатыПроекта.УИДУсловия);	
			ЗаполнитьЗначенияСвойств(ПараметрыОплатыПроекта, ПараметрыОплаты, РеквизитыОплаты);  	
		КонецЦикла; 
	КонецЕсли;
	
	//
	Для Каждого ПараметрЗакупки Из ТаблицаПараметровЗакупкиКопия Цикл
		ДеревоСвойство = Дерево.Строки.Добавить();
		ДеревоСвойство.Свойство = ПараметрЗакупки.Параметр;
		ДеревоСвойство.ДетальнаяЗапись = Ложь;       
		
		Для Каждого СтрокаПотребности Из Потребности Цикл   
			
			Если Не ЭтоУХ Тогда
				//ПараметрыОплаты
				ПараметрыОплатыСтроки = ПараметрыОплатыПроектов.НайтиСтроки(Новый Структура("ПоложениеОЗакупках, УИДУсловия", 
				СтрокаПотребности.ПоложениеОЗакупках, 
				СтрокаПотребности.УИДУсловия));
				Если ПараметрыОплатыСтроки.Количество() = 0 Тогда       
					ПараметрыОплаты = Справочники.ПоложениеОЗакупках.ПолучитьПараметрыОплаты(СтрокаПотребности.ПоложениеОЗакупках, СтрокаПотребности.УИДУсловия); 
					НовыйПараметр = ПараметрыОплатыПроектов.Добавить();    
					ЗаполнитьЗначенияСвойств(НовыйПараметр, ПараметрыОплаты);
				Иначе
					ПараметрыОплаты = ПараметрыОплатыСтроки[0];
				КонецЕсли; 
				
				Если Потребности.Колонки.Найти(ПараметрЗакупки.ПараметрИмя) = Неопределено Или Потребности.Колонки.Найти(ПараметрЗакупки.ЗапретИзменения) = Неопределено Тогда
					Продолжить;
				КонецЕсли;         
			КонецЕсли;
			
			Если СтрокаПотребности[ПараметрЗакупки.ПараметрИмя] <> Null Тогда  
				
				Если Не ЭтоУХ Тогда
					//ГрафикОплаты
					Если ПараметрЗакупки.Параметр = ПланыВидовХарактеристик.ПараметрыЗакупки.ГрафикОплаты Тогда
						СтрокаПотребности.ГрафикОплаты 					= ПараметрыОплаты.ГрафикОплаты;  
						СтрокаПотребности.ЗапретИзменения_ГрафикОплаты 	= ПараметрыОплаты.ЗапретИзменения_ГрафикОплаты;    
					КонецЕсли;   
					//КалендарьГрафика
					Если ПараметрЗакупки.Параметр = ПланыВидовХарактеристик.ПараметрыЗакупки.КалендарьГрафика Тогда
						СтрокаПотребности.КалендарьГрафика 					= ПараметрыОплаты.КалендарьГрафика;  
						СтрокаПотребности.ЗапретИзменения_КалендарьГрафика 	= ПараметрыОплаты.ЗапретИзменения_КалендарьГрафика;    
					КонецЕсли;  
				КонецЕсли;
				
				СтрокаДерева = ДеревоСвойство.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаПотребности);
				СтрокаДерева.Свойство = ДеревоСвойство.Свойство;
				СтрокаДерева.Значение = СтрокаПотребности[ПараметрЗакупки.ПараметрИмя];
				СтрокаДерева.ЗапретИзменения = СтрокаПотребности[ПараметрЗакупки.ЗапретИзменения];
				СтрокаДерева.ДетальнаяЗапись = Истина;
				СтрокаДерева.ИндексКартинки = ?(СтрокаДерева.ЗапретИзменения, 0, 1);      
				
				СтрокаДерева.ПоложениеОЗакупках = СтрокаПотребности.ПоложениеОЗакупках;
				СтрокаДерева.УИДУсловия = СтрокаПотребности.УИДУсловия; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//
	РассчитатьИтоговыеПараметрыЗакупки(Дерево);
	
	Возврат Дерево;
	
КонецФункции

Функция СформироватьПараметрыЗакупкиКорзины(Автор, ПериодЗакупки, ПустойУИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Автор", Автор);
	Запрос.УстановитьПараметр("ПериодЗакупки", ПериодЗакупки);
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроектыСПЗПозиции.ОрганизацияЗаказчик КАК ОрганизацияЗаказчик,
	|	ПроектыСПЗПозиции.ПериодЗакупки КАК ПериодЗакупки,
	|	ПроектыСПЗПозиции.ПериодПотребности КАК ПериодПотребности,
	|	ПроектыСПЗПозиции.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
	|	ПроектыСПЗПозиции.АналитикаПотребностей КАК АналитикаПотребностей,
	|	ПроектыСПЗПозиции.АналитикаСтруктуры КАК АналитикаСтруктуры,
	|	ПроектыСПЗПозиции.АналитикаНоменклатуры.Номенклатура.КодОКПД2 КАК ОКПД2,
	|	ВЫБОР
	|		КОГДА ПроектыСПЗПозиции.АналитикаНоменклатуры.Номенклатура ССЫЛКА Справочник.ТоварныеКатегории
	|			ТОГДА ВЫРАЗИТЬ(ПроектыСПЗПозиции.АналитикаНоменклатуры.Номенклатура КАК Справочник.ТоварныеКатегории)
	|		КОГДА ПроектыСПЗПозиции.АналитикаНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ПроектыСПЗПозиции.АналитикаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).ТоварнаяКатегория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТоварныеКатегории.ПустаяСсылка)
	|	КОНЕЦ КАК ТоварнаяКатегория,
	|	СУММА(ПроектыСПЗПозиции.Количество) КАК КоличествоКОбработке,
	|	СУММА(ПроектыСПЗПозиции.Сумма) КАК СуммаКОбработке
	|ПОМЕСТИТЬ ВТ_Потребности
	|ИЗ
	|	РегистрСведений.ПроектыСПЗПозиции КАК ПроектыСПЗПозиции
	|ГДЕ
	|	ПроектыСПЗПозиции.Автор = &Автор
	|	И ПроектыСПЗПозиции.ИД = &ПустойУИД
	|	И ПроектыСПЗПозиции.ПериодЗакупки = &ПериодЗакупки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроектыСПЗПозиции.ОрганизацияЗаказчик,
	|	ПроектыСПЗПозиции.АналитикаСтруктуры,
	|	ПроектыСПЗПозиции.АналитикаНоменклатуры,
	|	ПроектыСПЗПозиции.ПериодЗакупки,
	|	ПроектыСПЗПозиции.ПериодПотребности,
	|	ПроектыСПЗПозиции.АналитикаПотребностей
	|
	|ИМЕЮЩИЕ
	|	НЕ(СУММА(ПроектыСПЗПозиции.Количество) = 0
	|			И СУММА(ПроектыСПЗПозиции.Сумма) = 0)
	|;
	|"
	+ ТекстЗапроса_ПолучитьДанныеДляАвтоматическогоФормированияСПЗ();
	ДанныеСПЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаПараметровЗакупки = ПланыВидовХарактеристик.ПараметрыЗакупки.ПолучитьТаблицуНастроекПараметровЗакупки();
	
	ПараметрыЗакупки = СформироватьДеревоПараметровЗакупки(ДанныеСПЗ, ТаблицаПараметровЗакупки);
	
	Возврат ПараметрыЗакупки;
	
КонецФункции 

Функция ТекстЗапроса_ПолучитьДанныеДляАвтоматическогоФормированияСПЗ()     
	
	Если ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда 
		ТекстЗапроса = 
						"ВЫБРАТЬ Различные
						|	ВТ_Потребности.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
						|	ВТ_Потребности.АналитикаПотребностей КАК АналитикаПотребностей,
						|	ВТ_Потребности.АналитикаПланирования КАК АналитикаПланирования,
						|	ВТ_Потребности.АналитикаИсточника КАК АналитикаИсточника,
						|	ВТ_Потребности.АналитикаСтруктуры КАК АналитикаСтруктуры,
						|	ВТ_Потребности.ОрганизацияЗаказчик КАК ОрганизацияЗаказчик,
						|	ВТ_Потребности.ПериодПотребности КАК ПериодПотребности,
						|	ВТ_Потребности.КоличествоКОбработке КАК Количество,
						|	ВТ_Потребности.СуммаКОбработке КАК Сумма,
						|	ВТ_Потребности.ТоварнаяКатегория КАК ТоварнаяКатегория,
						|	ВТ_Потребности.ОКПД2 КАК ОКПД2,
						|	ВТ_Потребности.АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
						|	ВТ_Потребности.АналитикаНоменклатуры.Характеристика КАК Характеристика,
						|	ВТ_Потребности.АналитикаПотребностей.МестоПоставки КАК МестоПоставки,
						|	ВТ_Потребности.АналитикаПотребностей.Приоритет КАК Приоритет,
						|	ВТ_Потребности.КлючПараметровЗакупки КАК КлючПараметровЗакупки,
						|	ВТ_Потребности.АналитикаПотребностей.Менеджер КАК Менеджер,
						|	ВТ_Потребности.АналитикаПотребностей.Назначение КАК Назначение,
						|	ВТ_Потребности.АналитикаСтруктуры.ЦФО КАК ЦФО,
						|	ВТ_Потребности.АналитикаСтруктуры.Проект КАК Проект,
						|	ВТ_Потребности.АналитикаСтруктуры.Организация КАК Организация,
						|	ПараметрыЗакупкиПотребностей1.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
						|	ПараметрыЗакупкиПотребностей1.УИДУсловия КАК УИДУсловия,
						|	КлючиПараметровЗакупки.Ссылка КАК Ссылка,
						|	КлючиПараметровЗакупки.ВерсияДанных КАК ВерсияДанных,
						|	КлючиПараметровЗакупки.ПометкаУдаления КАК ПометкаУдаления,
						|	КлючиПараметровЗакупки.Организатор КАК Организатор,
						|	КлючиПараметровЗакупки.СпособЗакупки КАК СпособЗакупки,
						|	КлючиПараметровЗакупки.Электронно КАК Электронно,
						|	КлючиПараметровЗакупки.Обоснование КАК Обоснование,
						|	КлючиПараметровЗакупки.ДлительностьПодготовки КАК ДлительностьПодготовки,
						|	КлючиПараметровЗакупки.ДлительностьПроцедуры КАК ДлительностьПроцедуры,
						|	КлючиПараметровЗакупки.ЗакупкаИВПиЛС КАК ЗакупкаИВПиЛС,
						|	КлючиПараметровЗакупки.ГосТайна КАК ГосТайна,
						|	КлючиПараметровЗакупки.ПриоритетСМП КАК ПриоритетСМП,
						|	КлючиПараметровЗакупки.СубподрядчикиСМП КАК СубподрядчикиСМП,
						|	КлючиПараметровЗакупки.ФлагиВозможностиИзменения КАК ФлагиВозможностиИзменения,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Организатор КАК ЗапретИзменения_Организатор,
						|	КлючиПараметровЗакупки.ЗапретИзменения_СпособЗакупки КАК ЗапретИзменения_СпособЗакупки,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Электронно КАК ЗапретИзменения_Электронно,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Обоснование КАК ЗапретИзменения_Обоснование,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ДлительностьПодготовки КАК ЗапретИзменения_ДлительностьПодготовки,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ДлительностьПроцедуры КАК ЗапретИзменения_ДлительностьПроцедуры,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ЗакупкаИВПиЛС КАК ЗапретИзменения_ЗакупкаИВПиЛС,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ГосТайна КАК ЗапретИзменения_ГосТайна,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ПриоритетСМП КАК ЗапретИзменения_ПриоритетСМП,
						|	КлючиПараметровЗакупки.ЗапретИзменения_СубподрядчикиСМП КАК ЗапретИзменения_СубподрядчикиСМП,
						|	КлючиПараметровЗакупки.ЗапретИзменения_УсловияОплаты КАК ЗапретИзменения_УсловияОплаты,
						|	КлючиПараметровЗакупки.УсловияОплаты КАК УсловияОплаты,
						|	КлючиПараметровЗакупки.Предопределенный КАК Предопределенный,
						|	КлючиПараметровЗакупки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
						|ИЗ
						|	ВТ_Потребности КАК ВТ_Потребности
						|		Внутреннее СОЕДИНЕНИЕ РегистрСведений.ПараметрыЗакупкиПотребностей1 КАК ПараметрыЗакупкиПотребностей1
						|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиПараметровЗакупки КАК КлючиПараметровЗакупки
						|			ПО ПараметрыЗакупкиПотребностей1.КлючПараметровЗакупки = КлючиПараметровЗакупки.Ссылка
						|		ПО (&Автор = ПараметрыЗакупкиПотребностей1.Автор)
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаНоменклатуры = ПараметрыЗакупкиПотребностей1.АналитикаНоменклатуры
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаПотребностей = ПараметрыЗакупкиПотребностей1.АналитикаПотребностей
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаСтруктуры = ПараметрыЗакупкиПотребностей1.АналитикаСтруктуры";
	Иначе
		ТекстЗапроса = 
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ВТ_Потребности.АналитикаНоменклатуры КАК АналитикаНоменклатуры,
						|	ВТ_Потребности.АналитикаПотребностей КАК АналитикаПотребностей,
						|	ВТ_Потребности.АналитикаПланирования КАК АналитикаПланирования,
						|	ВТ_Потребности.АналитикаИсточника КАК АналитикаИсточника,
						|	ВТ_Потребности.АналитикаСтруктуры КАК АналитикаСтруктуры,
						|	ВТ_Потребности.ОрганизацияЗаказчик КАК ОрганизацияЗаказчик,
						|	ВТ_Потребности.ПериодПотребности КАК ПериодПотребности,
						|	ВТ_Потребности.КоличествоКОбработке КАК Количество,
						|	ВТ_Потребности.СуммаКОбработке КАК Сумма,
						|	ВТ_Потребности.ТоварнаяКатегория КАК ТоварнаяКатегория,
						|	ВТ_Потребности.ОКПД2 КАК ОКПД2,
						|	ВТ_Потребности.АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
						|	ВТ_Потребности.АналитикаНоменклатуры.Характеристика КАК Характеристика,
						|	ВТ_Потребности.АналитикаПотребностей.МестоПоставки КАК МестоПоставки,
						|	ВТ_Потребности.АналитикаПотребностей.Приоритет КАК Приоритет,
						|	ВТ_Потребности.КлючПараметровЗакупки КАК КлючПараметровЗакупки,
						|	ВТ_Потребности.АналитикаПотребностей.Менеджер КАК Менеджер,
						|	ВТ_Потребности.АналитикаПотребностей.Назначение КАК Назначение,
						|	ВТ_Потребности.АналитикаСтруктуры.ЦФО КАК ЦФО,
						|	ВТ_Потребности.АналитикаСтруктуры.Проект КАК Проект,
						|	ВТ_Потребности.АналитикаСтруктуры.Организация КАК Организация,
						|	ПараметрыЗакупкиПотребностей1.ПоложениеОЗакупках КАК ПоложениеОЗакупках,
						|	ПараметрыЗакупкиПотребностей1.УИДУсловия КАК УИДУсловия,
						|	КлючиПараметровЗакупки.Ссылка КАК Ссылка,
						|	КлючиПараметровЗакупки.ВерсияДанных КАК ВерсияДанных,
						|	КлючиПараметровЗакупки.ПометкаУдаления КАК ПометкаУдаления,
						|	КлючиПараметровЗакупки.Организатор КАК Организатор,
						|	КлючиПараметровЗакупки.СпособЗакупки КАК СпособЗакупки,
						|	КлючиПараметровЗакупки.Электронно КАК Электронно,
						|	КлючиПараметровЗакупки.Обоснование КАК Обоснование,
						|	КлючиПараметровЗакупки.ДлительностьПодготовки КАК ДлительностьПодготовки,
						|	КлючиПараметровЗакупки.ДлительностьПроцедуры КАК ДлительностьПроцедуры,
						|	КлючиПараметровЗакупки.ЗакупкаИВПиЛС КАК ЗакупкаИВПиЛС,
						|	КлючиПараметровЗакупки.ГосТайна КАК ГосТайна,
						|	КлючиПараметровЗакупки.ПриоритетСМП КАК ПриоритетСМП,
						|	КлючиПараметровЗакупки.СубподрядчикиСМП КАК СубподрядчикиСМП,
						|	КлючиПараметровЗакупки.ФлагиВозможностиИзменения КАК ФлагиВозможностиИзменения,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Организатор КАК ЗапретИзменения_Организатор,
						|	КлючиПараметровЗакупки.ЗапретИзменения_СпособЗакупки КАК ЗапретИзменения_СпособЗакупки,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Электронно КАК ЗапретИзменения_Электронно,
						|	КлючиПараметровЗакупки.ЗапретИзменения_Обоснование КАК ЗапретИзменения_Обоснование,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ДлительностьПодготовки КАК ЗапретИзменения_ДлительностьПодготовки,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ДлительностьПроцедуры КАК ЗапретИзменения_ДлительностьПроцедуры,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ЗакупкаИВПиЛС КАК ЗапретИзменения_ЗакупкаИВПиЛС,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ГосТайна КАК ЗапретИзменения_ГосТайна,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ПриоритетСМП КАК ЗапретИзменения_ПриоритетСМП,
						|	КлючиПараметровЗакупки.ЗапретИзменения_СубподрядчикиСМП КАК ЗапретИзменения_СубподрядчикиСМП,
						|	КлючиПараметровЗакупки.ЗапретИзменения_УсловияОплаты КАК ЗапретИзменения_УсловияОплаты,
						|	КлючиПараметровЗакупки.УсловияОплаты КАК УсловияОплаты,
						|	КлючиПараметровЗакупки.Предопределенный КАК Предопределенный,
						|	КлючиПараметровЗакупки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
						|	КлючиПараметровЗакупки.ГрафикОплаты КАК ГрафикОплаты,
						|	КлючиПараметровЗакупки.ЗапретИзменения_ГрафикОплаты КАК ЗапретИзменения_ГрафикОплаты,
						|	КлючиПараметровЗакупки.КалендарьГрафика КАК КалендарьГрафика,
						|	КлючиПараметровЗакупки.ЗапретИзменения_КалендарьГрафика КАК ЗапретИзменения_КалендарьГрафика
						|ИЗ
						|	ВТ_Потребности КАК ВТ_Потребности
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЗакупкиПотребностей1 КАК ПараметрыЗакупкиПотребностей1
						|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиПараметровЗакупки КАК КлючиПараметровЗакупки
						|			ПО ПараметрыЗакупкиПотребностей1.КлючПараметровЗакупки = КлючиПараметровЗакупки.Ссылка
						|		ПО (&Автор = ПараметрыЗакупкиПотребностей1.Автор)
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаНоменклатуры = ПараметрыЗакупкиПотребностей1.АналитикаНоменклатуры
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаПотребностей = ПараметрыЗакупкиПотребностей1.АналитикаПотребностей
						|			И ВТ_Потребности.АналитикаПланирования.АналитикаСтруктуры = ПараметрыЗакупкиПотребностей1.АналитикаСтруктуры";

	КонецЕсли;
		
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура РассчитатьИтоговыеПараметрыЗакупки(ДеревоПараметровЗакупки)
	
	// Расчет параметров СПЗ
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить(Тип("Число"));
	ПростыеТипы.Добавить(Тип("Строка"));
	ПростыеТипы.Добавить(Тип("Дата"));
	ПростыеТипы.Добавить(Тип("Булево"));
	
	Для Каждого ДеревоПараметр Из ДеревоПараметровЗакупки.Строки Цикл
		
		Результат = Новый Структура("Значение, ЗапретИзменения", ДеревоПараметр.Свойство.ТипЗначения.ПривестиЗначение(неопределено), Ложь);
		ЭтоПростойТип = ПростыеТипы.Найти(ТипЗнч(Результат.Значение)) <> неопределено;
		
		Для Каждого Строка Из ДеревоПараметр.Строки Цикл
			
			Если Строка.ЗапретИзменения Тогда
				Результат.ЗапретИзменения = Истина;
				Результат.Значение = Строка.Значение;
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(Строка.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоПростойТип И Не ТипЗнч(Результат.Значение) = Тип("Строка") Тогда
				Результат.Значение = Макс(Результат.Значение, Строка.Значение);
			Иначе
				Результат.Значение = Строка.Значение;   
			КонецЕсли;
			
		КонецЦикла;      
		
		ДеревоПараметр.ПоложениеОЗакупках 	= Строка.ПоложениеОЗакупках;
		ДеревоПараметр.УИДУсловия 			= Строка.УИДУсловия;
		
		ДеревоПараметр.Значение 			= Результат.Значение;
		ДеревоПараметр.ЗапретИзменения 		= Результат.ЗапретИзменения;
		ДеревоПараметр.ИндексКартинки 		= ?(ДеревоПараметр.ЗапретИзменения, 0, 1);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти							
							
#КонецЕсли
